export const tasks = [
  {
    id: 1,
    numberEGE: 8,
    content:
      "Определите количество семизначных чисел, записанных в девятеричной системе счисления, которые не начинаются с нечётных цифр, оканчиваются на цифры, не делящиеся на 3 без остатка, а также содержат в своей записи хотя бы одну цифру 6.",
    answer: 1,
    author: "PRO100 ЕГЭ",
    difficulty_level: "Уровень ЕГЭ",
    actuallity: "Актуальная",
    task_status: "",
  },
  {
    id: 2,
    numberEGE: 8,
    content:
      "(ЕГЭ-2024) В файле 17-409.txt содержится последовательность целых чисел, не превышающих по модулю 100 000. Определите количество троек элементов последовательности, в которых хотя бы два элемента из трех оканчиваются на 7 и являются четырёхзначными числами, а сумма всех элементов тройки больше максимального элемента последовательности, оканчивающегося на 7 и являющегося четырехзначным числом. В ответе запишите количество найденных троек, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три подряд идущих элемента последовательности.",
    answer: 1,
    author: "PRO100 ЕГЭ",
    difficulty_level: "Уровень ЕГЭ",
    actuallity: "Актуальная",
    task_status: "solved-wa",
  },
  {
    id: 3,
    numberEGE: 8,
    content:
      "Мистер Шерлок Холмс взялся за одно очень крупное и интересное дело. На Риджент-стрит расположено N домов по кругу (это значит, что первый и последний дома – соседи). В каждом из этих домов содержится определённое количество улик (целое число от 0 до 10 включительно). Гениальный сыщик хочет собрать как можно больше улик, не посещая при этом двух соседних домов ни разу. Также Шерлок Холмс хочет завершить этот обыск как можно скорее и успеть на чашку чая с доктором Ватсоном. Помогите ему при помощи современных технологий XXI века как можно быстрее определить, какое максимальное количество улик удастся собрать при заданных условиях.",
    answer: 1,
    author: "PRO100 ЕГЭ",
    difficulty_level: "Уровень ЕГЭ",
    actuallity: "Актуальная",
    task_status: "solved-ok",
  },
  {
    id: 4,
    numberEGE: 8,
    content: "",
    answer: 1,
    author: "PRO100 ЕГЭ",
    difficulty_level: "Уровень ЕГЭ",
    actuallity: "Актуальная",
    task_status: "solved-ok",
  },
];
